In [1]:
#http://pandas.pydata.org/pandas-docs/stable/10min.html
#10 Minutes to pandasÂ¶
import pandas as pd

In [2]:
import numpy as np

In [3]:
 import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2013-01-01 -0.394581  1.120075  1.357503 -1.161249
2013-01-02  0.510279  1.212699 -0.295850 -0.854872
2013-01-03  1.946129  0.537970 -0.921120  0.617704
2013-01-04  1.297156  0.492785  0.644239 -1.158115
2013-01-05 -0.530441 -1.324421 -0.079985 -0.031891
2013-01-06  0.624007 -0.271157  0.102469  1.035023

In [10]:
df2 = pd.DataFrame({ 'A' : 1.,
                      'B' : pd.Timestamp('20130102'),
                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                      'D' : np.array([3] * 4,dtype='int32'),
                      'E' : pd.Categorical(["test","train","test","train"]),
                      'F' : 'foo' })

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df2.<TAB>

SyntaxError: invalid syntax (<ipython-input-13-915637deb483>, line 1)

In [14]:
df.head()

                   A         B         C         D
2013-01-01 -0.394581  1.120075  1.357503 -1.161249
2013-01-02  0.510279  1.212699 -0.295850 -0.854872
2013-01-03  1.946129  0.537970 -0.921120  0.617704
2013-01-04  1.297156  0.492785  0.644239 -1.158115
2013-01-05 -0.530441 -1.324421 -0.079985 -0.031891

In [15]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.297156  0.492785  0.644239 -1.158115
2013-01-05 -0.530441 -1.324421 -0.079985 -0.031891
2013-01-06  0.624007 -0.271157  0.102469  1.035023

In [16]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [18]:
df.values

array([[-0.39458122,  1.12007508,  1.35750307, -1.161249  ],
       [ 0.51027932,  1.21269853, -0.29585001, -0.85487165],
       [ 1.9461286 ,  0.53796975, -0.92111966,  0.61770397],
       [ 1.29715602,  0.49278494,  0.64423863, -1.15811536],
       [-0.53044131, -1.3244205 , -0.07998527, -0.03189119],
       [ 0.62400723, -0.27115663,  0.10246861,  1.03502283]])

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.575425  0.294659  0.134543 -0.258900
std    0.956052  0.955419  0.787672  0.945749
min   -0.530441 -1.324421 -0.921120 -1.161249
25%   -0.168366 -0.080171 -0.241884 -1.082304
50%    0.567143  0.515377  0.011242 -0.443381
75%    1.128869  0.974549  0.508796  0.455305
max    1.946129  1.212699  1.357503  1.035023

In [20]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.394581    0.510279    1.946129    1.297156   -0.530441    0.624007
B    1.120075    1.212699    0.537970    0.492785   -1.324421   -0.271157
C    1.357503   -0.295850   -0.921120    0.644239   -0.079985    0.102469
D   -1.161249   -0.854872    0.617704   -1.158115   -0.031891    1.035023

In [21]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.161249  1.357503  1.120075 -0.394581
2013-01-02 -0.854872 -0.295850  1.212699  0.510279
2013-01-03  0.617704 -0.921120  0.537970  1.946129
2013-01-04 -1.158115  0.644239  0.492785  1.297156
2013-01-05 -0.031891 -0.079985 -1.324421 -0.530441
2013-01-06  1.035023  0.102469 -0.271157  0.624007

In [22]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05 -0.530441 -1.324421 -0.079985 -0.031891
2013-01-06  0.624007 -0.271157  0.102469  1.035023
2013-01-04  1.297156  0.492785  0.644239 -1.158115
2013-01-03  1.946129  0.537970 -0.921120  0.617704
2013-01-01 -0.394581  1.120075  1.357503 -1.161249
2013-01-02  0.510279  1.212699 -0.295850 -0.854872

In [23]:
df['A']

2013-01-01   -0.394581
2013-01-02    0.510279
2013-01-03    1.946129
2013-01-04    1.297156
2013-01-05   -0.530441
2013-01-06    0.624007
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.394581  1.120075  1.357503 -1.161249
2013-01-02  0.510279  1.212699 -0.295850 -0.854872
2013-01-03  1.946129  0.537970 -0.921120  0.617704

In [25]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.510279  1.212699 -0.295850 -0.854872
2013-01-03  1.946129  0.537970 -0.921120  0.617704
2013-01-04  1.297156  0.492785  0.644239 -1.158115

In [26]:
df.loc[dates[0]]

A   -0.394581
B    1.120075
C    1.357503
D   -1.161249
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.394581  1.120075
2013-01-02  0.510279  1.212699
2013-01-03  1.946129  0.537970
2013-01-04  1.297156  0.492785
2013-01-05 -0.530441 -1.324421
2013-01-06  0.624007 -0.271157

In [28]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.510279  1.212699
2013-01-03  1.946129  0.537970
2013-01-04  1.297156  0.492785

In [29]:
df.loc['20130102',['A','B']]

A    0.510279
B    1.212699
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.loc[dates[0],'A']

-0.3945812195290354

In [31]:
df.at[dates[0],'A']

-0.3945812195290354

In [32]:
df.iloc[3]

A    1.297156
B    0.492785
C    0.644239
D   -1.158115
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.297156  0.492785
2013-01-05 -0.530441 -1.324421

In [34]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.510279 -0.295850
2013-01-03  1.946129 -0.921120
2013-01-05 -0.530441 -0.079985

In [35]:
df.iloc[1:3,:]

                   A         B        C         D
2013-01-02  0.510279  1.212699 -0.29585 -0.854872
2013-01-03  1.946129  0.537970 -0.92112  0.617704

In [36]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.120075  1.357503
2013-01-02  1.212699 -0.295850
2013-01-03  0.537970 -0.921120
2013-01-04  0.492785  0.644239
2013-01-05 -1.324421 -0.079985
2013-01-06 -0.271157  0.102469

In [37]:
df.iloc[1,1]

1.2126985316371155

In [38]:
df.iat[1,1]

1.2126985316371155

In [39]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.510279  1.212699 -0.295850 -0.854872
2013-01-03  1.946129  0.537970 -0.921120  0.617704
2013-01-04  1.297156  0.492785  0.644239 -1.158115
2013-01-06  0.624007 -0.271157  0.102469  1.035023

In [40]:
 df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.120075  1.357503       NaN
2013-01-02  0.510279  1.212699       NaN       NaN
2013-01-03  1.946129  0.537970       NaN  0.617704
2013-01-04  1.297156  0.492785  0.644239       NaN
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06  0.624007       NaN  0.102469  1.035023

In [41]:
df2 = df.copy()

In [42]:
df2['E'] = ['one', 'one','two','three','four','three']

In [43]:
df2

                   A         B         C         D      E
2013-01-01 -0.394581  1.120075  1.357503 -1.161249    one
2013-01-02  0.510279  1.212699 -0.295850 -0.854872    one
2013-01-03  1.946129  0.537970 -0.921120  0.617704    two
2013-01-04  1.297156  0.492785  0.644239 -1.158115  three
2013-01-05 -0.530441 -1.324421 -0.079985 -0.031891   four
2013-01-06  0.624007 -0.271157  0.102469  1.035023  three